import React from 'react'
import Title from '../components/Title'
import { assets } from '../assets/assets'


const Nutrition = () => {
  return (
    <div>

      <div className='text-2xl text-center pt-8 border-t'>
          <Title text1={'สาระความรู้เกี่ยวกับ'} text2={'โภชนาการ'} />
      </div>

      <div className='my-10 flex flex-col md:flex-row gap-16'>
          <img className='w-full md:max-w-[450px]' src={assets.about_img} alt="" />
          <div className='flex flex-col justify-center gap-6 md:w-2/4 text-gray-600'>
              <b className='text-gray-800'>ผู้รับประทานอาหารประเภทคลีน</b>
              <p>ผู้รับประทานอาหารประเภทคลีน เน้นการบริโภคอาหารที่ผ่านการปรุงแต่งน้อยที่สุด หรืออาจกล่าวได้ว่าเป็นอาหารที่ใกล้เคียงกับธรรมชาติมากที่สุดเท่าที่จะเป็นไปได้
              การรับประทาน: เน้นวัตถุดิบสดใหม่ หลีกเลี่ยงอาหารแปรรูป ลดการปรุงรสจัดจ้าน เช่น เค็ม มัน หวาน มุ่งเน้นการได้รับสารอาหารครบถ้วน</p>
              <b className='text-gray-800'>ผู้รับประทานอาหารประเภทคีโต</b>
              <p>ผู้รับประทานอาหารประเภทคีโต หรือ คีโตเจนิคไดเอท เป็นรูปแบบการกินที่เน้นการลดปริมาณคาร์โบไฮเดรตลงอย่างมาก และเพิ่มปริมาณไขมันเข้าไปแทน
              ทำให้ช่วยลดน้ำหนักได้เร็ว ควบคุมระดับน้ำตาลในเลือด และเพิ่มพลังงาน</p>
              <b className='text-gray-800'>ผู้เป็นโรคเบาหวาน </b>
              <p>โรคเบาหวาน เป็นโรคเรื้อรังที่เกิดจากร่างกายไม่สามารถควบคุมระดับน้ำตาลในเลือดได้อย่างเหมาะสม
              สาเหตุ: พันธุกรรม/ไลฟ์สไตล์ที่ไม่ดี เช่น การกินอาหารหวานจัด ขาดการออกกำลังกาย/ความผิดปกติของตับอ่อน
              อาการ: ปัสสาวะบ่อย/กระหายน้ำมาก/อ่อนเพลีย/น้ำหนักลด
              การรักษา: ยา/อินซูลิน/การควบคุมอาหาร/การออกกำลังกาย</p>
  
          </div>
      </div>
      
    </div>
  )
}

export default Nutrition
